{
    "skills": [
      {
        "id": "1",
        "src": "/skills/java.png",
        "title": "Java",
        "description": "I am fluent in Java and have hands on expereince on its core concepts, design patterns, architecture, and advanced frameworks."
      },
      {
        "id": "2",
        "src": "/skills/spring.png",
        "title": "Spring",
        "description": "I excel in data management using Spring and have extensive experience with Spring Boot, Spring Batch and Spring data JPA for streamlined application development. My proficiency extends to thorough testing within the Spring framework, ensuring the creation of robust applications."
      },      
      {
        "id": "3",
        "src": "/skills/python.png",
        "title": "Python",
        "description": "I've extensively utilized Python in diverse projects, maximizing its versatility for enhanced project efficiency. I seamlessly integrated Python into my workflow, utilizing key libraries like Numpy, Tensorflow, and Turtle Graphics to achieve optimal results."
      },
      {
        "id": "4",
        "src": "/skills/database.png",
        "title": "Database",
        "description": "Managing relational databases, including MySQL, PostgreSQL and TSQL, as well as in handling NoSQL databases like MongoDB. ORM frameworks, specifically Hibernate, Java Persistence API (JPA), and Enterprise JavaBeans (EJB)."
      },
      {
        "id": "5",
        "src": "/skills/webservices.png",
        "title": "Web Srevices",
        "description": "I possess adeptness in working with web services, encompassing both REST and SOAP protocols. This proficiency extends to hands-on experience with industry-standard examples of web services, facilitating seamless communication and integration between diverse applications."
      },
      {
        "id": "6",
        "src": "/skills/frontend.png",
        "title": "Front End",
        "description": "Proficient in JavaScript, ReactJS, and ExpressJS, I create dynamic user interfaces. Using HTML, SCSS, and Bootstrap, I design structured and visually appealing layouts. Hands-on expertise in EmberJS enriches my ability to build scalable web applications."
      },
      {
        "id": "7",
        "src": "/skills/dev-ops.png",
        "title": "Dev Ops",
        "description": "Experienced in DevOps tools, I proficiently utilize GIT and JIRA for planning, Maven and Gradle for builds, JUnit for testing, Jenkins for integration, and Docker with Ansible for deployment and orchestration."
      },
      {
        "id": "8",
        "src": "/skills/source-control.png",
        "title": "Source Control",
        "description": "Proficient in source control, I am adept at utilizing both Git and Perforce for effective version management."
      },
      {
        "id": "9",
        "src": "/skills/testing.png",
        "title": "Unit Testing",
        "description": "All projects I worked on had been properly tested and executed. These testings include tools such as JUnit, Selenium and Mockito for unit testing and Spring test to cover Functional and Acceptance Tests."
      }
    ]
  }